Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: Luckily, Git provides a tool to help you send properly formatted patches via IMAP, which may be easier for you.
cs: Git naštěstí nabízí nástroj, který vám pomůže odeslat správně formátované patche pomocí protokolu IMAP.

source: Luckily, `git status` tells you how to do that, too.
cs: Příkaz `git status` vám naštěstí řekne, co dělat.

source: Managing a complex series of parallel contributed topic branches.
cs: Správa komplexní série současně zpracovávaných příspěvků v tematických větvích

source: Managing remote repositories includes knowing how to add remote repositories, remove remotes that are no longer valid, manage various remote branches and define them as being tracked or not, and more.
cs: Při správě vzdálených repozitářů musíte vědět, jak lze přidat vzdálený repozitář, jak odstranit vzdálený repozitář, který už není platný, jak spravovat různé vzdálené větve, jak je definovat jako sledované či nesledované a další věci.

source: Many Git developers have a workflow that embraces this approach, such as having only code that is entirely stable in their `master` branch — possibly only code that has been or will be released.
cs: Mnoho vývojářů systému Git používá pracovní postup, kdy mají ve větvi `master` pouze kód, který je stoprocentně stabilní — třeba jen kód, který byl nebo bude součástí vydání.

source: Many groups switch to Git because of this ability to have multiple teams working in parallel, merging the different lines of work late in the process.
cs: Mnoho skupin přechází na systém Git právě kvůli této možnosti paralelní spolupráce několika týmů a následného slučování různých linií práce.

source: Many larger projects have established procedures for accepting patches — you’ll need to check the specific rules for each project, because they will differ.
cs: Mnoho větších projektů si vytvořilo vlastní, odlišné procedury pro přijímání záplat. U každého projektu se tak budete muset informovat o konkrétních pravidlech, protože se mohou lišit.

source: Many options are useful only in edge cases that I won’t go over here.
cs: Mnoho parametrů je využitelných pouze ve specifických případech, jimž se nebudu v této knize věnovat.

source: Many people use Git without using any of these tips, and we won’t refer to them or assume you’ve used them later in the book; but you should probably know how to do them.
cs: Mnoho uživatelů pracuje se systémem Git, aniž by tyto triky používali. V dalších částech knihy se už o nich nebudeme zmiňovat, ale asi byste měli vědět, jak jich využít.

source: Many people’s version-control method of choice is to copy files into another directory (perhaps a time-stamped directory, if they’re clever).
cs: Uživatelé často provádějí správu verzí tím způsobem, že zkopírují soubory do jiného adresáře (pokud jsou chytří, označí adresář i příslušným datem).

source: Many times, when working with Git, you may want to revise your commit history for some reason.
cs: Při práci se systémem Git možná budete z nějakého důvodu čas od času potřebovat poopravit historii revizí.

source: Merging a branch to integrate the diverged work history.
cs: Integrace rozdělené historie sloučením větví

source: Merging contributed topic branches into long-term integration branches.
cs: Začlenění tematických větví s příspěvky do dlouhodobých integračních větví

source: Metadata won't give you a full representation of your file's content, but in any case it's better than nothing.
cs: Metadata vám sice neposkytnou plnou reprezentaci obsahu souboru, ale v každém případě je to lepší než nic.

source: Modified means that you have changed the file but have not committed it to your database yet.
cs: Změněno znamená, že v souboru byly provedeny změny, avšak soubor ještě nebyl zapsán do databáze.

source: More detailed explanatory text, if necessary.
cs: Podrobnější popis revize, je-li třeba.

source: More important, you can use any tool you like to rename a file, and address the add/rm later, before you commit.
cs: Důležitější je, že můžete použít jakýkoli způsob přejmenování a příkaz add/rm provést později, před zapsáním revize.

source: More stable branches are generally farther down the commit history.
cs: Stabilnější větve většinou leží v historii revizí níže.

source: Most of that should be easy to follow.
cs: Většina uvedeného by měla být jasná.

source: Most of the time, this command does nothing.
cs: Ve většině případů neprovede tento příkaz vůbec nic.

source: Most operations in Git only need local files and resources to operate — generally no information is needed from another computer on your network.
cs: Většina operací v systému Git vyžaduje ke své činnosti pouze lokální soubory a zdroje a nejsou potřeba informace z jiných počítačů v síti.

source: Much as the `git svn log` command simulates the `svn log` command offline, you can get the equivalent of `svn annotate` by running `git svn blame [FILE]`.
cs: Tak jako příkaz `git svn log` simuluje příkaz `svn log` (bez nutnosti připojení), ekvivalentem příkazu `svn annotate` je provedení `git svn blame [SOUBOR]`.

source: Multiple branches pointing into the commit’s data history.
cs: Několik větví ukazujících do historie dat revizí

source: NOTE: If you are running on Windows you’ll need to make sure that you add one extra step.
cs: Poznámka: Pokud používáte Windows, budete muset provést jeden krok navíc.

source: Name this remote `teamone`, which will be your shortname for that whole URL (see Figure 3-25).
cs: Pojmenujte tento vzdálený server jako `teamone`, což bude zkrácený název pro celou URL adresu (viz obrázek 3-25).

source: Nearly every VCS has some form of branching support.
cs: Téměř každý systém pro správu verzí podporuje do určité míry větvení.

source: Next is the Git protocol.
cs: Dalším protokolem v pořadí je protokol Git.

source: Next you can create a new repository.
cs: Jako další krok následuje vytvoření nového repozitáře.

source: Next you need to turn your shell back on for the 'git' user, if you changed it to the `git-shell` command.
cs: Dále musíte znovu zapnout shell na uživatele 'git', jestliže jste ho změnili na příkaz `git-shell`.

source: Next, Gitosis wants to put its repositories under `/home/git`, which is fine.
cs: Gitosis dále vyžaduje, abyste jeho repozitáře uložili do adresáře `/home/git`.

source: Next, John e-mails Jessica to say he’s pushed some changes to the `featureA` branch and ask her to verify them.
cs: Poté pošle John Jessice e-mail, že odeslal několik změn do větve `featureA`, a poprosí ji, aby je ověřila.

source: Next, access over SSH is secure — all data transfer is encrypted and authenticated.
cs: Z dalších výhod bychom měli zmínit také to, že přístup přes protokol SSH je bezpečný, veškerý přenos dat je šifrovaný a autentizovaný.

source: Next, move the rest of the references under `refs/remotes` to be local branches:
cs: Ze zbytku referencí vytvořte v repozitáři `refs/remotes` lokální větve:

source: Next, suppose your loss was for some reason not in the reflog — you can simulate that by removing `recover-branch` and deleting the reflog.
cs: Můžeme ale také uvažovat situaci, že ztracené revize nebyly ve výpisu reflog k nalezení. Tento stav můžeme simulovat tak, že odstraníme větev `recover-branch` a smažeme reflog.

source: Next, the client uploads a packfile of all the objects the server doesn’t have yet.
cs: Jako další krok nahraje klient balíčkový soubor se všemi třemi objekty, které na serveru dosud nejsou.

source: Next, the person who pushed the merged work decides to go back and rebase their work instead; they do a `git push --force` to overwrite the history on the server.
cs: Jenže osoba, která odeslala a začlenila své změny, se rozhodne vrátit a svou práci raději přeskládat. Provede příkaz `git push --force` a přepíše historii na serveru.

source: Next, try to make each commit a logically separate changeset.
cs: Dále se snažte provádět každou revizi jako logicky samostatný soubor změn.

source: Next, we’ll cover Git’s killer feature: its branching model.
cs: V další kapitole se podíváme na exkluzivní funkci systému Git – na model větvení.

source: Next, you clone and install Gitosis from the project’s main site:
cs: Dále naklonujte a nainstalujte Gitosis z hlavní stránky projektu:

source: Next, you have a hotfix to make.
cs: Nyní přichází na řadu hotfix.

source: Next, you have to manually set the execute bit on the `post-update` script for your new control repository.
cs: Dále je třeba ručně nastavit právo spuštění na skriptu `post-update` pro nový řídicí repozitář.

source: Next, you have to tell your Gitosis server which repositories to allow unauthenticated Git server-based access to.
cs: Dále budete muset svému serveru Gitosis sdělit, k jakým repozitářům si přejete povolit neautentizovaný serverový přístup Git.

source: Next, you have two more objects to retrieve — `cfda3b`, which is the tree of content that the commit we just retrieved points to; and `085bb3`, which is the parent commit:
cs: Máte však ještě další dva objekty, které potřebujete načíst: `cfda3b`, což je strom obsahu, na nějž ukazuje revize, kterou jsme právě načetli; druhým objektem je `085bb3`, což je rodič revize:

source: Next, you look for what the HEAD reference is so you know what to check out when you’re finished:
cs: Dále budete chtít zjistit, co je referencí HEAD, abyste mohli po dokončení procesu provést checkout.

source: Next, you need to add a VirtualHost entry to your Apache configuration with the document root as the root directory of your Git projects.
cs: Dále je třeba přidat záznam VirtualHost do konfigurace Apache s kořenovým adresářem dokumentů nastaveným jako kořenový adresář vašich projektů Git.

source: Next, you need to add some developer SSH public keys to the `authorized_keys` file for that user.
cs: V dalším kroku musíte vložit veřejné SSH klíče od svých vývojářů do souboru `authorized_keys` pro tohoto uživatele.

source: Next, you need to push your change upstream.
cs: Jako další krok tak chcete odeslat provedené změny do vzdáleného repozitáře.

source: Next, you want to make sure you aren’t modifying files that are outside your ACL scope.
cs: Dále se budete chtít ujistit, že neměníte soubory, jejichž úpravu vám zakazuje seznam ACL.

source: Next, you’ll see how to work the other side of the coin: maintaining a Git project.
cs: V další části se na projekty podíváme z té druhé strany – ukážeme, jak může vypadat jejich správa.

source: Next, you’ll write the other two commit objects, each referencing the commit that came directly before it:
cs: Dále zapíšete i zbylé dva objekty revize. Oba budou odkazovat na revizi, která jim bezprostředně předcházela:

source: No `-w` option is needed — calling `write-tree` automatically creates a tree object from the state of the index if that tree doesn’t yet exist:
cs: Tentokrát se obejdete bez parametru `-w`. Příkaz `write-tree` automaticky vytvoří objekt stromu ze stavu indexu, pokud tento strom ještě neexistuje:

source: No commit was completed in that instance.
cs: V takovém případě nebyla zapsána žádná revize.

source: No more branch on your server.
cs: A větev je ze serveru pryč.

source: No problems occur; as you can see, it was a simple fast-forward.
cs: Tento postup je bezproblémový. Jak vidíte, šlo o jednoduchý posun „rychle vpřed“.

source: Non-rewind push to master or integ is allowed by the first rule.
cs: Odeslání do větve `master` nebo `integ`, která nevracejí zpět změny (non-rewind push), jsou povolena prvním pravidlem.

source: Normally, you get as the original commit the commit where you copied the code over, because that is the first time you touched those lines in this file.
cs: Normálně se jako původní revize zobrazí ta, kam jste kód zkopírovali, protože to bylo poprvé, kdy jste v daném souboru sáhli do těchto řádků.

source: Not nearly as many configuration options are available for the server side of Git, but there are a few interesting ones you may want to take note of.
cs: Na straně serveru není ani zdaleka tolik parametrů konfigurace jako na straně klienta, avšak několik zajímavých si jistě zaslouží vaši pozornost.

source: Not only does the Author field look a lot better, but the `git-svn-id` is no longer there, either.
cs: Nejenže teď pole Author vypadá podstatně lépe, ale navíc jste se zbavili i záznamu `git-svn-id`.

source: Note on Windows usage: you should use Git with the provided msysGit shell (Unix style), it allows to use the complex lines of command given in this book.
cs: Poznámka k používání pod Windows: Git byste měli používat z dodaného shellu msysGit (unixový styl). Umožní vám zadávat složité řádkové příkazy, které v této knize naleznete.

source: Note that someone must shell onto the machine and create a bare repository every time you want to add a project.
cs: Nezapomeňte, že pokaždé, když chcete vytvořit projekt, musí se k počítači někdo přihlásit a vytvořit holý repozitář.

source: Note that the snapshot pointed to by the final commit you end up with, whether it’s the last of the rebased commits for a rebase or the final merge commit after a merge, is the same snapshot — it’s only the history that is different.
cs: Ještě jednou bychom chtěli upozornit, že snímek, na který ukazuje závěrečná revize – ať už se jedná o poslední z přeskládaných revizí po přeskládání, nebo poslední revizi sloučením jako výsledek začlenění – je vždy stejný. Jediné, co se liší, je historie.

source: Note that this is a lot different than the concept of HEAD in other VCSs you may be used to, such as Subversion or CVS.
cs: Nenechte se mást, tento HEAD je velmi odlišný od všech koncepcí v ostatních systémech pro správu verzí, na něž jste možná zvyklí, jako Subversion nebo CVS.

source: Note the backslash (`\`) in front of the `*`.
cs: Všimněte si tu zpětného lomítka (`\`) před znakem `*`.

source: Note: Because many systems think of their revisions as changes from one commit to another, fast-import can also take commands with each commit to specify which files have been added, removed, or modified and what the new contents are.
cs: Poznámka: Vzhledem k tomu, že mnoho systémů chápe revize jako změny od jednoho zapsání k druhému, přijímá fast-import také příkazy s každým zapsáním a zjišťuje, které soubory byly přidány, odstraněny nebo změněny a co je jejich novým obsahem.

source: Notice how in the example of remote references imported from `git svn`, tags are added as remote branches, not as real Git tags.
cs: Všimněte si, že v příkladu vzdálených referencí importovaných nástrojem `git svn` jsou značky přidány jako vzdálené větve, nikoli jako skutečné značky Git.

source: Notice how this changes the way you work with Subversion — you can do several commits offline and then push them all at once to the Subversion server.
cs: Všimněte si, jak se tím mění váš způsob práce v systému Subversion. Můžete zapsat několik revizí offline a poté je na server Subversion odeslat všechny najednou.

source: Notice how you don’t have to run `git add` on the `benchmarks.rb` file in this case before you commit.
cs: Povšimněte si, že kvůli souboru `benchmarks.rb` v tomto případě nemusíte před zapsáním revize provádět příkaz `git add`.

source: Notice that "scott" (the name of the pubkey in the `gitolite setup` command you used earlier) has read-write permissions on the `gitolite-admin` repository as well as a public key file of the same name.
cs: Všimněte si, že „scott“ (jméno veřejného klíče v dříve použitém příkazu `gitolite setup`) má práva pro čtení i zápis k repozitáři `gitolite-admin` a také stejnojmenný veřejný klíč.

source: Notice that the SHA checksum that originally started with `97031e5` when you committed now begins with `938b1a5`.
cs: Všimněte si, že kontrolní součet SHA, který před zapsáním revize původně začínal kombinací znaků `97031e5`, nyní začíná `938b1a5`.

source: Notice that the `lib` subdirectory isn’t a blob but a pointer to another tree:
cs: Všimněte si, že podadresář `lib` není blob, ale ukazatel na jiný strom:

source: Notice that the first field is the partial SHA-1 of the commit that last modified that line.
cs: Všimněte si, že první pole je část hodnoty SHA-1 revize, v níž byl řádek naposled změněn.

source: Notice that the object entry points to the commit SHA-1 value that you tagged.
cs: Všimněte si, že záznam objektu ukazuje na hodnotu revize SHA-1, k níž jste značku přidali.

source: Notice that this tree has both file entries and also that the test.txt SHA is the "version 2" SHA from earlier (`1f7a7a`).
cs: Všimněte si, že tento strom má oba záznamy souborů a že hodnota SHA souboru test.txt je SHA původní „verze 2“ (`1f7a7a`).

source: Notice that you don’t need to specify the path (in fact, doing so won’t work), just a colon and then the name of the project — Gitosis finds it for you.
cs: Všimněte si, že není třeba zadávat cestu (naopak, příkaz by pak nefungoval), pouze dvojtečku a za ní název projektu. Gitosis už projekt vyhledá.

source: Notice that you have to tell the command where to find your Git repositories with the `GITWEB_PROJECTROOT` variable.
cs: Všimněte si, že musíte příkazu pomocí proměnné `GITWEB_PROJECTROOT` sdělit, kde najde repozitáře Git.

source: Notice that you printed that out to stdout at the very beginning of your update script.
cs: Všimněte si, že toto bylo posláno na standardní výstup „stdout“ na samém začátku skriptu update.

source: Notice the 160000 mode for the rack entry.
cs: Všimněte si režimu (mode) 160000 u záznamu rack.

source: Notice the `*` character that prefixes the `master` branch: it indicates the branch that you currently have checked out.
cs: Všimněte si znaku `*`, který předchází větvi `master`. Označuje větev, na níž se právě nacházíte.

source: Notice the last line of the file, which begins with a `^`.
cs: Všimněte si také posledního řádku souboru, který začíná znakem `^`.

source: Notice the reverse order.
cs: Všimněte si, že se pořadí obrátilo.

source: Now Git knows that if it tries to do a diff between two snapshots, and any of the files end in `.doc`, it should run those files through the "word" filter, which is defined as the `catdoc` program.
cs: Git nyní ví, že až se bude pokoušet vypočítat rozdíl mezi dvěma snímky a každý ze souborů končící na `.doc` se má prohnat přes filtr „word“, který je definován jako program `catdoc`.

source: Now Jessica merges in John’s work (`origin/master`):
cs: Nyní Jessica začlení Johnovu práci (`origin/master`):

source: Now John can clone the project and get updates, but Gitosis won’t allow him to push back up to the project.
cs: John nyní může naklonovat projekt a stahovat jeho aktualizace, ale Gitosis mu neumožní, aby odesílal data zpět do projektu.

source: Now `benchmarks.rb` is listed as both staged and unstaged.
cs: Soubor `benchmarks.rb` je nyní uveden jak v části připraveno k zapsání (Changes to be committed), tak v části nepřipraveno k zapsání (Changes not staged for commit).

source: Now `git diff` will be able to tell you what changed in `.odt` files.
cs: Teď už bude `git diff` schopen říci, co se v `.odt` souborech změnilo.

source: Now `origin/master` is reachable from Jessica’s `master` branch, so she should be able to successfully push (assuming John hasn’t pushed again in the meantime):
cs: Větev `origin/master` teď má Jessica dostupnou ze své větve `master`, takže může svou práci úspěšně odeslat (za předpokladu, že John mezitím neodeslal další revize):

source: Now all the old branches are real Git branches and all the old tags are real Git tags.
cs: Všechny staré větve jsou nyní skutečnými větvemi Git a všechny staré značky jsou nyní skutečnými značkami Git.

source: Now it’s time to initialize Gitosis.
cs: V tomto okamžiku můžeme inicializovat nástroj Gitosis.

source: Now set up the `odt` diff filter in `.git/config`:
cs: A teď v `.git/config` nastavte diff filtr pro `odt`:

source: Now suppose you did that in a branch.
cs: Nyní předpokládejme, že toto vše se odehrálo ve větvi.

source: Now that it knows the server’s state, your `send-pack` process determines what commits it has that the server doesn’t.
cs: Nyní, když zná proces `send-pack` stav serveru, určí, jaké revize má, které přitom nejsou na serveru.

source: Now that you can (I hope) determine which workflow combination may work for you, I’ll cover some more specific examples of how to accomplish the main roles that make up the different flows.
cs: Nyní, když už se (jak doufám) dokážete rozhodnout, která kombinace postupů pro vás bude ta nejvhodnější, ukážeme si některé konkrétní příklady, jak lze rozdělit hlavní role, z nichž vyplývají jednotlivé postupy práce.

source: Now that you can specify individual commits, let’s see how to specify ranges of commits.
cs: Nyní, když umíte určit jednotlivé revize, podíváme se, jak lze určovat celé intervaly revizí.

source: Now that you have Git on your system, you’ll want to do a few things to customize your Git environment.
cs: Nyní, když máte Git nainstalovaný, můžete provést některá uživatelská nastavení systému.

source: Now that you have a Subversion repository to which you have write access, you can go through a typical workflow.
cs: Nyní máte repozitář Subversion s oprávněním pro zápis, a proto se můžeme podívat na typický postup práce.

source: Now that you have a bare copy of your repository, all you need to do is put it on a server and set up your protocols.
cs: Nyní, když máte vytvořenu holou kopii repozitáře, zbývá ji už jen umístit na server a nastavit protokoly.

source: Now that you have a remote Git repository set up as a point for all the developers to share their code, and you’re familiar with basic Git commands in a local workflow, you’ll look at how to utilize some of the distributed workflows that Git affords you.
cs: Nyní máte vytvořen vzdálený repozitář Git jako místo, kde mohou všichni vývojáři sdílet zdrojový kód, a znáte základní příkazy systému Git pro práci v lokálním prostředí. Je čas podívat se na využití některých distribuovaných postupů, které vám Git nabízí.

source: Now that you have a working repository, you can do some work on the project and push your commits back upstream, using Git effectively as a SVN client.
cs: Máte vytvořen pracovní repozitář a můžete se pustit do práce na projektu. Časem ale budete chtít odeslat revize zpět do repozitáře a použít při tom Git jako klienta SVN.

source: Now that you have an integer representation of your commit, you need a date for the commit metadata.
cs: Nyní jste označili revizi celým číslem a zbývá stanovit datum pro metadata revize.

source: Now that you have basic read/write and read-only access to your project, you may want to set up a simple web-based visualizer.
cs: Nyní, když máte ke svému projektu nastavena základní oprávnění pro čtení/zápis a pouze pro čtení, možná budete chtít nastavit jednoduchou online vizualizaci.

source: Now that you have the basics of branching and merging down, what can or should you do with them?
cs: Teď, když jste absolvovali základní seznámení s větvemi a jejich slučováním, nabízí se otázka, k čemu je to vlastně dobré.

source: Now that you have the contents of your key in Git, you can create a tag that points directly to it by specifying the new SHA-1 value that the `hash-object` command gave you:
cs: Nyní máte obsah svého klíče v systému Git a můžete vytvořit značku, která bude ukazovat přímo na něj. Zadejte proto novou hodnotu SHA-1, kterou jste získali příkazem `hash-object`:

source: Now that you have the packfile index, you can see if your object is in it — because the index lists the SHAs of the objects contained in the packfile and the offsets to those objects.
cs: Nyní, když máte index balíčkového souboru, můžete ověřit, zda se v něm nachází váš objekt. Index uvádí hodnoty SHA všech objektů obsažených v balíčkovém souboru a ofsety k těmto objektům.
